Stapimaz/cs_p1/GD32VW55X_Wifi_BLE_SDK/GD32VW55x_RELEASE_V1.0.2/MSDK/cloud/tuya/tuyaos_adapter/src/tkl_spi.c
/**
 * @file tkl_spi.c
 * @brief this file was auto-generated by tuyaos v&v tools, developer can add implements between BEGIN and END
 *
 * @warning: changes between user 'BEGIN' and 'END' will be keeped when run tuyaos v&v tools
 *           changes in other place will be overwrited and lost
 *
 * @copyright Copyright 2020-2021 Tuya Inc. All Rights Reserved.
 *
 */

// --- BEGIN: user defines and implements ---
#include "gd32vw55x.h"
#include "tkl_spi.h"
#include "tuya_error_code.h"
#include "gd32vw55x_spi.h"
#include "gd32vw55x_rcu.h"
#include "wrapper_os.h"
#include "dbg_print.h"
// --- END: user defines and implements ---

#ifdef TUYAOS_SUPPORT

#define SPI_DEV_NUM             1

#define SPI_DMA_RX              DMA_CH0
#define SPI_DMA_TX              DMA_CH4

#define SPI_SEND_OP_MSK         0x01
#define SPI_RECV_OP_MSK         0x02
#define SPI_TRANS_SEND_OP_MSK   0x04
#define SPI_TRANS_RECV_OP_MSK   0x08
#define SPI_DMA_SEND_CMPLT_MSK  0x10
#define SPI_DMA_RECV_CMPL_MSK   0x20

#define SET_SPI_NSS_HIGH        gpio_bit_set(GPIOA, GPIO_PIN_12)
#define SET_SPI_NSS_LOW         gpio_bit_reset(GPIOA, GPIO_PIN_12)

typedef struct spi_env
{
    TUYA_SPI_ROLE_E       role;
    spi_parameter_struct  spi_param;
    UINT8_T               op_msk;
    TUYA_SPI_STATUS_T     status;
    VOID_T* send_buf;
    VOID_T* receive_buf;
} spi_env_t;

static spi_env_t spi_env_info;
static BOOL_T spi_irq_en = FALSE;
static TUYA_SPI_IRQ_CB spi_irq_cb = NULL;

static void tkl_spi_disable_irqs()
{
    if (spi_irq_en) {
        spi_interrupt_disable(SPI_INT_TBE);
        spi_interrupt_disable(SPI_INT_RBNE);
        spi_interrupt_disable(SPI_INT_ERR);
    }
}

static void tkl_spi_tx_dma_conf(VOID_T *data, UINT16_T size)
{
    dma_single_data_parameter_struct dma_init_struct;

    dma_single_data_para_struct_init(&dma_init_struct);
    dma_deinit(SPI_DMA_TX);
    dma_init_struct.periph_addr         = (uint32_t)&SPI_DATA;
    dma_init_struct.memory0_addr        = (uint32_t)data;
    dma_init_struct.direction           = DMA_MEMORY_TO_PERIPH;
    if (spi_env_info.spi_param.frame_size == SPI_FRAMESIZE_8BIT) {
        dma_init_struct.periph_memory_width = DMA_MEMORY_WIDTH_8BIT;
    } else {
        dma_init_struct.periph_memory_width = DMA_MEMORY_WIDTH_16BIT;
    }
    dma_init_struct.priority            = DMA_PRIORITY_LOW;
    dma_init_struct.number              = size;
    dma_init_struct.periph_inc          = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_inc          = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.circular_mode       = DMA_CIRCULAR_MODE_DISABLE;
    dma_single_data_mode_init(SPI_DMA_TX, &dma_init_struct);
    dma_channel_subperipheral_select(SPI_DMA_TX, DMA_SUBPERI3);

    dma_interrupt_flag_clear(SPI_DMA_TX, DMA_INT_FLAG_FTF);
    dma_interrupt_flag_clear(SPI_DMA_TX, DMA_INT_FLAG_FEE);

    if (spi_irq_en) {
        dma_interrupt_enable(SPI_DMA_TX, DMA_INT_FTF);
        dma_interrupt_enable(SPI_DMA_TX, DMA_INT_FEE);
    } else {
        dma_interrupt_disable(SPI_DMA_TX, DMA_INT_FTF);
        dma_interrupt_disable(SPI_DMA_TX, DMA_INT_FEE);
    }

    /* SPI_Tx DMA channel */
    dma_channel_enable(SPI_DMA_TX);
}

static void tkl_spi_rx_dma_conf(VOID_T *data, UINT16_T size)
{
    dma_single_data_parameter_struct dma_init_struct;

    dma_single_data_para_struct_init(&dma_init_struct);
    dma_deinit(SPI_DMA_RX);
    dma_init_struct.periph_addr         = (uint32_t)&SPI_DATA;
    dma_init_struct.memory0_addr        = (uint32_t)data;
    dma_init_struct.direction           = DMA_PERIPH_TO_MEMORY;
    if (spi_env_info.spi_param.frame_size == SPI_FRAMESIZE_8BIT) {
        dma_init_struct.periph_memory_width = DMA_MEMORY_WIDTH_8BIT;
    } else {
        dma_init_struct.periph_memory_width = DMA_MEMORY_WIDTH_16BIT;
    }
    dma_init_struct.priority            = DMA_PRIORITY_HIGH;
    dma_init_struct.number              = size;
    dma_init_struct.periph_inc          = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_inc          = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.circular_mode       = DMA_CIRCULAR_MODE_DISABLE;
    dma_single_data_mode_init(SPI_DMA_RX, &dma_init_struct);
    dma_channel_subperipheral_select(SPI_DMA_RX, DMA_SUBPERI3);

    dma_interrupt_flag_clear(SPI_DMA_RX, DMA_INT_FLAG_FTF);
    dma_interrupt_flag_clear(SPI_DMA_RX, DMA_INT_FLAG_FEE);

    if (spi_irq_en) {
        dma_interrupt_enable(SPI_DMA_RX, DMA_INT_FTF);
        dma_interrupt_enable(SPI_DMA_RX, DMA_INT_FEE);
    } else {
        dma_interrupt_disable(SPI_DMA_RX, DMA_INT_FTF);
        dma_interrupt_disable(SPI_DMA_RX, DMA_INT_FEE);
    }

    /* SPI_Rx DMA channel */
    dma_channel_enable(SPI_DMA_RX);
}


void DMA_Channel4_IRQHandler(void)
{
    //dbg_print(ERR, "DMA_Channel4_IRQHandler op_msk 0x%x \r\n", spi_env_info.op_msk);
    if (RESET != dma_interrupt_flag_get(SPI_DMA_TX, DMA_INT_FLAG_FEE)) {
        if (spi_irq_cb) {
            spi_irq_cb(TUYA_SPI_NUM_0, TUYA_SPI_EVENT_DATA_LOST);
        }
        spi_env_info.status.data_lost = 1;
        spi_env_info.op_msk = 0;
        dma_interrupt_flag_clear(SPI_DMA_TX, DMA_INT_FLAG_FEE);
    } else if (RESET != dma_interrupt_flag_get(SPI_DMA_TX, DMA_INT_FLAG_FTF)) {
        if (spi_env_info.op_msk & (SPI_TRANS_SEND_OP_MSK | SPI_TRANS_RECV_OP_MSK)) {
            spi_env_info.op_msk &= (~SPI_TRANS_SEND_OP_MSK);
            if (spi_irq_cb) {
                if (spi_env_info.op_msk == 0) {
                    spi_irq_cb(TUYA_SPI_NUM_0, TUYA_SPI_EVENT_TRANSFER_COMPLETE);
                }
                // Wait for receive complete
            }
        } else {
            spi_env_info.op_msk |= SPI_DMA_SEND_CMPLT_MSK;
        }
        dma_interrupt_flag_clear(SPI_DMA_TX, DMA_INT_FLAG_FTF);
    }

    if (spi_env_info.op_msk == 0) {
        if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
            if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE || spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
                spi_nss_internal_high();
            } else
                SET_SPI_NSS_HIGH;
        }
        spi_dma_disable(SPI_DMA_TRANSMIT);
        spi_dma_disable(SPI_DMA_RECEIVE);
        tkl_spi_disable_irqs();

        spi_disable();
    }

