Stapimaz/cs_p1/GD32VW55X_Wifi_BLE_SDK/GD32VW55x_RELEASE_V1.0.2/MSDK/cloud/tuya/tuyaos_adapter/src/tkl_spi.c
    if (spi_env_info.send_buf == NULL) {
        sys_mfree(spi_env_info.send_buf);
        spi_env_info.send_buf = NULL;
    }
}

void DMA_Channel0_IRQHandler(void)
{
    //dbg_print(ERR, "DMA_Channel0_IRQHandler op_msk 0x%x \r\n", spi_env_info.op_msk);
    if (RESET != dma_interrupt_flag_get(SPI_DMA_RX, DMA_INT_FLAG_FEE)) {
        if (spi_irq_cb) {
            spi_irq_cb(TUYA_SPI_NUM_0, TUYA_SPI_EVENT_DATA_LOST);
        }
        spi_env_info.status.data_lost = 1;
        spi_env_info.op_msk = 0;
        dma_interrupt_flag_clear(SPI_DMA_RX, DMA_INT_FLAG_FEE);
    } else if(RESET != dma_interrupt_flag_get(SPI_DMA_RX, DMA_INT_FLAG_FTF)) {
        if (spi_env_info.op_msk & (SPI_TRANS_SEND_OP_MSK | SPI_TRANS_RECV_OP_MSK)) {
            spi_env_info.op_msk &= (~SPI_TRANS_RECV_OP_MSK);
            if (spi_irq_cb) {
                if (spi_env_info.op_msk == 0) {
                    spi_irq_cb(TUYA_SPI_NUM_0, TUYA_SPI_EVENT_TRANSFER_COMPLETE);
                }
                // Wait for send complete
            }
        } else {
            spi_env_info.op_msk = 0;
            if (spi_irq_cb) {
                spi_irq_cb(TUYA_SPI_NUM_0, TUYA_SPI_EVENT_RX_COMPLETE);
            }
        }
        dma_interrupt_flag_clear(SPI_DMA_RX, DMA_INT_FLAG_FTF);
    }

    if (spi_env_info.op_msk == 0) {
        if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
            if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE || spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
                spi_nss_internal_high();
            } else
                SET_SPI_NSS_HIGH;
        }

        spi_dma_disable(SPI_DMA_TRANSMIT);
        spi_dma_disable(SPI_DMA_RECEIVE);
        tkl_spi_disable_irqs();

        spi_disable();
    }

    if (spi_env_info.receive_buf == NULL) {
        sys_mfree(spi_env_info.receive_buf);
        spi_env_info.receive_buf = NULL;
    }
}


void SPI_IRQHandler(void)
{
    //dbg_print(ERR, "SPI_IRQHandler op_msk 0x%x \r\n", spi_env_info.op_msk);
    if (SET == spi_interrupt_flag_get(SPI_INT_FLAG_RXORERR)) {
        if (spi_env_info.op_msk != 0) {
            if (spi_irq_cb) {
                spi_irq_cb(TUYA_SPI_NUM_0, TUYA_SPI_EVENT_DATA_LOST);
            }
            spi_env_info.status.data_lost = 1;
            spi_env_info.op_msk = 0;
        }

        // Clear flag
        spi_data_receive();
        spi_flag_get(SPI_INT_FLAG_RXORERR);
    } else if (SET == spi_interrupt_flag_get(SPI_INT_FLAG_CONFERR)) {
        if (spi_irq_cb) {
            spi_irq_cb(TUYA_SPI_NUM_0, TUYA_SPI_EVENT_MODE_FAULT);
        }
        spi_env_info.status.mode_fault = 1;
        spi_env_info.op_msk = 0;
    } else if (spi_env_info.op_msk & SPI_SEND_OP_MSK) {
        if ((spi_env_info.op_msk & SPI_DMA_SEND_CMPLT_MSK) && RESET == spi_flag_get(SPI_FLAG_TRANS)) {
            if (spi_irq_cb) {
                spi_irq_cb(TUYA_SPI_NUM_0, TUYA_SPI_EVENT_TX_COMPLETE);
            }
            spi_env_info.op_msk = 0;
        }
    }


    if (spi_env_info.op_msk == 0) {
        if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
            if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE || spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
                spi_nss_internal_high();
            } else
                SET_SPI_NSS_HIGH;
        }
        spi_dma_disable(SPI_DMA_TRANSMIT);
        spi_dma_disable(SPI_DMA_RECEIVE);
        tkl_spi_disable_irqs();

        spi_disable();
    }
}

/**
 * @brief spi init
 *
 * @param[in] port: spi port
 *
 * @return OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_init(TUYA_SPI_NUM_E port, CONST TUYA_SPI_BASE_CFG_T *cfg)
{
    uint16_t psc = 0;

    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    } else if (cfg->role == TUYA_SPI_ROLE_INACTIVE || cfg->freq_hz > 160000000) {
        return OPRT_INVALID_PARM;
    }

    spi_deinit();

    /* wait for SPI stability */
    sys_ms_sleep(10);

    sys_memset(&spi_env_info, 0, sizeof(spi_env_t));

    rcu_periph_clock_enable(RCU_SPI);
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_DMA);

    // PA11: SPI_SCK
    gpio_af_set(GPIOA, GPIO_AF_0, GPIO_PIN_11);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, GPIO_PIN_11);
    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);

    spi_env_info.role = cfg->role;

    if (spi_env_info.role == TUYA_SPI_ROLE_MASTER_SIMPLEX) {
        spi_env_info.spi_param.device_mode = SPI_MASTER;
        // PA9: SPI_MOSI
        gpio_af_set(GPIOA, GPIO_AF_0, GPIO_PIN_9);
        gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_9);
        gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, GPIO_PIN_9);
    } else if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
        spi_env_info.spi_param.device_mode = SPI_SLAVE;
        // PA10: SPI_MISO
        gpio_af_set(GPIOA, GPIO_AF_0, GPIO_PIN_10);
        gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_10);
        gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, GPIO_PIN_10);
    } else {
        // PA9: SPI_MOSI, PA10: SPI_MISO
        gpio_af_set(GPIOA, GPIO_AF_0, GPIO_PIN_10 | GPIO_PIN_9);
        if (cfg->role == TUYA_SPI_ROLE_MASTER) {
            gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_10 | GPIO_PIN_9);
        } else {
            gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLDOWN, GPIO_PIN_10 | GPIO_PIN_9);
        }
        gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, GPIO_PIN_10 | GPIO_PIN_9);
        spi_env_info.spi_param.trans_mode = SPI_TRANSMODE_FULLDUPLEX;
        spi_env_info.spi_param.device_mode = cfg->role == TUYA_SPI_ROLE_MASTER ? SPI_MASTER : SPI_SLAVE;
    }

    switch (cfg->mode) {
    case TUYA_SPI_MODE0:
        spi_env_info.spi_param.clock_polarity_phase = SPI_CK_PL_LOW_PH_1EDGE;
        break;

    case TUYA_SPI_MODE1:
        spi_env_info.spi_param.clock_polarity_phase = SPI_CK_PL_LOW_PH_2EDGE;
        break;

    case TUYA_SPI_MODE2:
        spi_env_info.spi_param.clock_polarity_phase = SPI_CK_PL_HIGH_PH_1EDGE;
        break;

    case TUYA_SPI_MODE3:
        spi_env_info.spi_param.clock_polarity_phase = SPI_CK_PL_HIGH_PH_2EDGE;
        break;

    default:
        dbg_print(ERR, "unknown spi mode \r\n");
        return OPRT_INVALID_PARM;
    }

    if (cfg->type == TUYA_SPI_SOFT_TYPE || cfg->type == TUYA_SPI_SOFT_ONE_WIRE_TYPE) {
        spi_env_info.spi_param.nss = SPI_NSS_SOFT;
        if (spi_env_info.role == TUYA_SPI_ROLE_MASTER || spi_env_info.role == TUYA_SPI_ROLE_MASTER_SIMPLEX) {
            // Need to remove when mater in software mode
            // PA12: SPI_NSS
            gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_12);
            gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, GPIO_PIN_12);
        }
    } else {
        spi_env_info.spi_param.nss = SPI_NSS_HARD;
        // PA12: SPI_NSS
        gpio_af_set(GPIOA, GPIO_AF_6, GPIO_PIN_12);
        gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_12);
        gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_10MHZ, GPIO_PIN_12);
    }

