Stapimaz/cs_p1/GD32VW55X_Wifi_BLE_SDK/GD32VW55x_RELEASE_V1.0.2/MSDK/cloud/tuya/tuyaos_adapter/src/tkl_spi.c
    if (cfg->databits == TUYA_SPI_DATA_BIT8) {
        spi_env_info.spi_param.frame_size = SPI_FRAMESIZE_8BIT;
    } else {
        spi_env_info.spi_param.frame_size = SPI_FRAMESIZE_16BIT;
    }

    if (cfg->bitorder == TUYA_SPI_ORDER_MSB2LSB) {
        spi_env_info.spi_param.endian = SPI_ENDIAN_MSB;
    } else {
        spi_env_info.spi_param.endian = SPI_ENDIAN_LSB;
    }

    if (cfg->freq_hz == 0) {
        psc = 256;
    } else {
        psc = 160000000 / cfg->freq_hz;
    }

    switch (psc) {
    case 2:
        spi_env_info.spi_param.prescale = SPI_PSC_2;
    break;

    case 4:
        spi_env_info.spi_param.prescale = SPI_PSC_4;
    break;

    case 8:
        spi_env_info.spi_param.prescale = SPI_PSC_8;
    break;

    case 16:
        spi_env_info.spi_param.prescale = SPI_PSC_16;
    break;

    case 32:
        spi_env_info.spi_param.prescale = SPI_PSC_32;
    break;

    case 64:
        spi_env_info.spi_param.prescale = SPI_PSC_64;
    break;

    case 128:
        spi_env_info.spi_param.prescale = SPI_PSC_128;
    break;

    case 256:
        spi_env_info.spi_param.prescale = SPI_PSC_256;
    break;

    default:
      spi_env_info.spi_param.prescale = SPI_PSC_256;
    break;
    }

    spi_disable();

    return OPRT_OK;
}

/**
 * @brief spi deinit
 *
 * @param[in] port: spi port
 *
 * @return OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_deinit(TUYA_SPI_NUM_E port)
{
    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    if (spi_env_info.op_msk != 0) {
        tkl_spi_disable_irqs();
        dma_channel_disable(SPI_DMA_TX);
        dma_channel_disable(SPI_DMA_RX);

        if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
            if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE || spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
                spi_nss_internal_high();
            } else
                SET_SPI_NSS_HIGH;
        }
        spi_dma_disable(SPI_DMA_TRANSMIT);
        spi_dma_disable(SPI_DMA_RECEIVE);
        spi_disable();
        spi_env_info.op_msk = 0;
    }

    spi_deinit();
    /* wait for SPI stability */
    sys_ms_sleep(10);

    if (spi_env_info.send_buf == NULL) {
        sys_mfree(spi_env_info.send_buf);
        spi_env_info.send_buf = NULL;
    }

    if (spi_env_info.receive_buf == NULL) {
        sys_mfree(spi_env_info.receive_buf);
        spi_env_info.receive_buf = NULL;
    }


    return OPRT_OK;
}

/**
 * Spi send
 *
 * @param[in]  port      the spi device
 * @param[in]  data     spi send data
 * @param[in]  size     spi send data size
 *
 * @return  OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_send(TUYA_SPI_NUM_E port, VOID_T *data, UINT16_T size)
{
    OPERATE_RET status = OPRT_OK;

    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    if (spi_env_info.role == TUYA_SPI_ROLE_MASTER_SIMPLEX) {
        spi_env_info.spi_param.trans_mode = SPI_TRANSMODE_BDTRANSMIT;
    } else if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
        spi_env_info.spi_param.trans_mode = SPI_TRANSMODE_BDTRANSMIT;
    } else {
        return tkl_spi_transfer(port, data, NULL, size);
    }

    if (spi_env_info.spi_param.nss == SPI_NSS_HARD && spi_env_info.role == TUYA_SPI_ROLE_MASTER_SIMPLEX) {
        spi_nss_output_enable();
    }

    spi_data_receive();
    spi_flag_get(SPI_INT_FLAG_CONFERR);

    spi_init(&spi_env_info.spi_param);

    if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
        if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
            spi_nss_internal_high();
        } else
            SET_SPI_NSS_HIGH;
    }

    if (spi_irq_en) {
        spi_interrupt_enable(SPI_INT_TBE);
        spi_interrupt_enable(SPI_INT_RBNE);
        spi_interrupt_enable(SPI_INT_ERR);
    }

    spi_env_info.op_msk = SPI_SEND_OP_MSK;
    tkl_spi_tx_dma_conf(data, size);
    spi_dma_enable(SPI_DMA_TRANSMIT);

    if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
        if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
            spi_nss_internal_low();
        } else
            SET_SPI_NSS_LOW;
    }

    spi_enable();

    // Wait for DMA transfer complete interrupt
    if (spi_irq_en) {
        return OPRT_OK;
    } else {
        while(1) {
            if (SET == dma_flag_get(SPI_DMA_TX, DMA_FLAG_FTF) && RESET == spi_flag_get(SPI_FLAG_TRANS)) {
                status = OPRT_OK;
                break;
            } else if (SET == dma_flag_get(SPI_DMA_TX, DMA_FLAG_FEE)) {
                status = OPRT_OS_ADAPTER_SPI_TRANS_ERR;
                spi_env_info.op_msk = 0;
                break;
            }
        }
    }

    if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
        if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
            spi_nss_internal_high();
        } else
            SET_SPI_NSS_HIGH;
    }

    spi_env_info.op_msk = 0;
    tkl_spi_disable_irqs();

    spi_dma_disable(SPI_DMA_TRANSMIT);
    dma_channel_disable(SPI_DMA_TX);

    spi_disable();

    return status;
}

/**
 * spi_recv
 *
 * @param[in]   port      the spi device
 * @param[out]  data     spi recv data
 * @param[in]   size     spi recv data size
 *
 * @return  OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_recv(TUYA_SPI_NUM_E port, VOID_T *data, UINT16_T size)
{
    OPERATE_RET status = OPRT_OK;

    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    if (spi_env_info.role == TUYA_SPI_ROLE_MASTER_SIMPLEX) {
        spi_env_info.spi_param.trans_mode = SPI_TRANSMODE_BDRECEIVE;
    } else if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
        spi_env_info.spi_param.trans_mode = SPI_TRANSMODE_BDRECEIVE;
    } else {
        return tkl_spi_transfer(port, NULL, data, size);
    }

    if (spi_env_info.spi_param.nss == SPI_NSS_HARD  && spi_env_info.role == TUYA_SPI_ROLE_MASTER_SIMPLEX) {
        spi_nss_output_enable();
    }

    spi_data_receive();
    spi_flag_get(SPI_INT_FLAG_CONFERR);

