Stapimaz/cs_p1/GD32VW55X_Wifi_BLE_SDK/GD32VW55x_RELEASE_V1.0.2/MSDK/cloud/tuya/tuyaos_adapter/src/tkl_spi.c
    if (spi_irq_en) {
        spi_interrupt_enable(SPI_INT_RBNE);
        spi_interrupt_enable(SPI_INT_ERR);
    }

    spi_init(&spi_env_info.spi_param);

    if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
        if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
            spi_nss_internal_high();
        } else
            SET_SPI_NSS_HIGH;
    }

    spi_env_info.op_msk = SPI_RECV_OP_MSK;
    tkl_spi_rx_dma_conf(data, size);
    spi_dma_enable(SPI_DMA_RECEIVE);

    if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
        if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
            spi_nss_internal_low();
        } else
            SET_SPI_NSS_LOW;
    }

    spi_enable();

    // Wait for DMA transfer complete interrupt
    if (spi_irq_en) {
        return OPRT_OK;
    } else {
        while(1) {
            if (SET == dma_flag_get(SPI_DMA_RX, DMA_FLAG_FTF)) {
                status = OPRT_OK;
                break;
            } else if (SET == dma_flag_get(SPI_DMA_RX, DMA_FLAG_FEE)) {
                status = OPRT_OS_ADAPTER_SPI_TRANS_ERR;
                spi_env_info.op_msk = 0;
                break;
            }
        }
    }

    if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
        if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
            spi_nss_internal_high();
        } else
            SET_SPI_NSS_HIGH;
    }

    spi_env_info.op_msk = 0;
    spi_dma_disable(SPI_DMA_RECEIVE);
    dma_channel_disable(SPI_DMA_RX);
    tkl_spi_disable_irqs();

    spi_disable();

    return status;
}

/**
 * @brief spi transfer
 *
 * @param[in] port: spi port
 * @param[in] send_buf: spi send buf
 * @param[out] send_buf:spi recv buf
 * @param[in] length: spi msg length
 *
 * @return OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_transfer(TUYA_SPI_NUM_E port, VOID_T* send_buf, VOID_T* receive_buf, UINT32_T length)
{
    OPERATE_RET status = OPRT_OK;

    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    if (spi_env_info.role != TUYA_SPI_ROLE_MASTER && spi_env_info.role != TUYA_SPI_ROLE_SLAVE)
        return OPRT_NOT_SUPPORTED;

    if (send_buf == NULL || receive_buf == NULL) {
        uint8_t unit = spi_env_info.spi_param.frame_size == SPI_FRAMESIZE_8BIT ? 1 : 2;

        if (send_buf == NULL) {
            spi_env_info.send_buf = sys_malloc(unit *length);
            if (spi_env_info.send_buf == NULL) {
                status = OPRT_MALLOC_FAILED;
                goto done;
            }
        }

        if (receive_buf == NULL) {
            spi_env_info.receive_buf = sys_malloc(unit *length);
            if (spi_env_info.receive_buf == NULL) {
                status = OPRT_MALLOC_FAILED;
                goto done;
            }
        }
    }

    if (spi_env_info.spi_param.nss == SPI_NSS_HARD && spi_env_info.role == TUYA_SPI_ROLE_MASTER) {
        // NSS output mode
        spi_nss_output_enable();
    }

    spi_data_receive();
    spi_flag_get(SPI_INT_FLAG_CONFERR);

    spi_init(&spi_env_info.spi_param);

    if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
        if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE) {
            spi_nss_internal_high();
        } else
            SET_SPI_NSS_HIGH;
    }

    spi_env_info.op_msk = SPI_TRANS_SEND_OP_MSK | SPI_TRANS_RECV_OP_MSK;
    tkl_spi_rx_dma_conf(receive_buf, length);
    tkl_spi_tx_dma_conf(send_buf, length);

    spi_dma_enable(SPI_DMA_TRANSMIT);
    spi_dma_enable(SPI_DMA_RECEIVE);

    if (spi_irq_en) {
        spi_interrupt_enable(SPI_INT_ERR);
    }

    if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
        if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE) {
            spi_nss_internal_low();
        } else
            SET_SPI_NSS_LOW;
    }

    spi_enable();

    // Wait for DMA transfer complete interrupt
    if (spi_irq_en) {
        return OPRT_OK;
    } else {
        while(1) {
            if (SET == dma_flag_get(SPI_DMA_RX, DMA_FLAG_FTF) && SET == dma_flag_get(SPI_DMA_TX, DMA_FLAG_FTF)) {
                status = OPRT_OK;
                break;
            } else if (SET == dma_flag_get(SPI_DMA_RX, DMA_FLAG_FEE) || SET == dma_flag_get(SPI_DMA_TX, DMA_FLAG_FEE)) {
                dbg_print(ERR, "tkl_spi_transfer dma err \r\n");
                status = OPRT_OS_ADAPTER_SPI_TRANS_ERR;
                spi_env_info.op_msk = 0;
                break;
            }
        }
    }

    if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
        if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE) {
            spi_nss_internal_high();
        } else
            SET_SPI_NSS_HIGH;
    }

    spi_env_info.op_msk = 0;
    spi_dma_disable(SPI_DMA_TRANSMIT);
    spi_dma_disable(SPI_DMA_RECEIVE);
    tkl_spi_disable_irqs();

    spi_disable();

done:
    if (spi_env_info.send_buf == NULL) {
        sys_mfree(spi_env_info.send_buf);
        spi_env_info.send_buf = NULL;
    }

    if (spi_env_info.receive_buf == NULL) {
        sys_mfree(spi_env_info.receive_buf);
        spi_env_info.receive_buf = NULL;
    }
    return status;
}

/**
 * @brief adort spi transfer,or spi send, or spi recv
 *
 * @param[in] port: spi port
 *
 * @return OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */

OPERATE_RET tkl_spi_abort_transfer(TUYA_SPI_NUM_E port)
{
    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    if (spi_env_info.op_msk != 0) {
        tkl_spi_disable_irqs();
        dma_channel_disable(SPI_DMA_TX);
        dma_channel_disable(SPI_DMA_RX);

        if (spi_env_info.spi_param.nss == SPI_NSS_SOFT) {
            if (spi_env_info.role == TUYA_SPI_ROLE_SLAVE || spi_env_info.role == TUYA_SPI_ROLE_SLAVE_SIMPLEX) {
                spi_nss_internal_high();
            } else
                SET_SPI_NSS_HIGH;
        }
        spi_dma_disable(SPI_DMA_TRANSMIT);
        spi_dma_disable(SPI_DMA_RECEIVE);
        spi_disable();

        spi_deinit();
        /* wait for SPI stability */
        sys_ms_sleep(10);
        spi_env_info.op_msk = 0;
    }

