Stapimaz/cs_p1/GD32VW55X_Wifi_BLE_SDK/GD32VW55x_RELEASE_V1.0.2/MSDK/cloud/tuya/tuyaos_adapter/src/tkl_spi.c
    if (spi_env_info.send_buf == NULL) {
        sys_mfree(spi_env_info.send_buf);
        spi_env_info.send_buf = NULL;
    }

    if (spi_env_info.receive_buf == NULL) {
        sys_mfree(spi_env_info.receive_buf);
        spi_env_info.receive_buf = NULL;
    }

    return OPRT_OK;
}

/**
 * @brief get spi status.
 *
 * @param[in] port: spi port
 * @param[out]  TUYA_SPI_STATUS_T,please refer to tuya_cloud_types.h
 * @return OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_get_status(TUYA_SPI_NUM_E port, TUYA_SPI_STATUS_T *status)
{
    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    *status = spi_env_info.status;
    if (spi_env_info.op_msk != 0) {
        status->busy = 1;
    }

    return OPRT_OK;
}

/**
 * @brief spi irq init
 * NOTE: call this API will not enable interrupt
 *
 * @param[in] port: spi port, id index starts at 0
 * @param[in] cb:  spi irq cb
 *
 * @return OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_irq_init(TUYA_SPI_NUM_E port, TUYA_SPI_IRQ_CB cb)
{
    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    eclic_irq_enable(SPI_IRQn, 8, 0);
    // SPI_DMA_RX
    if (SPI_DMA_RX == DMA_CH2) {
        eclic_irq_enable(DMA_Channel2_IRQn, 8, 0);
    } else {
        eclic_irq_enable(DMA_Channel0_IRQn, 8, 0);
    }

    // SPI_DMA_TX
    if (SPI_DMA_TX == DMA_CH4) {
        eclic_irq_enable(DMA_Channel4_IRQn, 8, 0);
    } else {
        eclic_irq_enable(DMA_Channel3_IRQn, 8, 0);
    }

    spi_irq_cb = cb;
    return OPRT_OK;
}

/**
 * @brief spi irq enable
 *
 * @param[in] port: spi port id, id index starts at 0
 *
 * @return OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_irq_enable(TUYA_SPI_NUM_E port)
{
    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    spi_irq_en = TRUE;
    return OPRT_OK;
}

/**
 * @brief spi irq disable
 *
 * @param[in] port: spi port id, id index starts at 0
 *
 * @return OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_irq_disable(TUYA_SPI_NUM_E port)
{
    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    tkl_spi_disable_irqs();

    spi_irq_en = FALSE;
    return OPRT_OK;
}

/**
 * @brief spi transferred data count.
 *
 * @param[in] port: spi port id, id index starts at 0
 *
 * @return >=0,number of currently transferred data items. <0,err.
 * during  tkl_spi_send, tkl_spi_recv and tkl_spi_transfer operation.
 */
INT32_T tkl_spi_get_data_count(TUYA_SPI_NUM_E port)
{
    if (port >= SPI_DEV_NUM) {
        return OPRT_NOT_SUPPORTED;
    }

    if (spi_env_info.op_msk == SPI_SEND_OP_MSK) {
        return (INT32_T)dma_transfer_number_get(DMA_CH4);
    } else if (spi_env_info.op_msk == SPI_RECV_OP_MSK) {
        return (INT32_T)dma_transfer_number_get(DMA_CH0);
    } else if (spi_env_info.op_msk != 0) {
        return (INT32_T)dma_transfer_number_get(DMA_CH4);
    }

    return 0;
}

/**
 * @brief spi ioctl
 *
 * @param[in]       cmd     user def
 * @param[in]       args    args associated with the command
 * @return OPRT_OK on success. Others on error, please refer to tuya_error_code.h
 */
OPERATE_RET tkl_spi_ioctl(TUYA_SPI_NUM_E port, UINT32_T cmd,  VOID *args)
{
    // --- BEGIN: user implements ---
    return OPRT_NOT_SUPPORTED;
    // --- END: user implements ---
}

#endif /* TUYAOS_SUPPORT */
